MikroElektronika/core_packages/PIC/XC8/def/PIC18LF1230/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF1230_H_
#define _PIC18LF1230_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18LF1230
 */
#ifndef _XC_H_
#warning Header file pic18lf1230.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: PORTA
#define PORTA PORTA
extern volatile unsigned char           PORTA               __at(0xF80);
#ifndef _LIB_BUILD
asm("PORTA equ 0F80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
        unsigned RA6                    :1;
        unsigned RA7                    :1;
    };
    struct {
        unsigned AN0                    :1;
        unsigned AN1                    :1;
        unsigned TX                     :1;
        unsigned RX                     :1;
        unsigned AN2                    :1;
        unsigned MCLR                   :1;
        unsigned OSC2                   :1;
        unsigned OSC1                   :1;
    };
    struct {
        unsigned INT0                   :1;
        unsigned INT1                   :1;
        unsigned CK                     :1;
        unsigned DT                     :1;
        unsigned T0CKI                  :1;
        unsigned                        :1;
        unsigned CLKO                   :1;
        unsigned CLKI                   :1;
    };
    struct {
        unsigned KBI0                   :1;
        unsigned KBI1                   :1;
        unsigned                        :2;
        unsigned VREFP                  :1;
        unsigned                        :1;
        unsigned T1OSO                  :1;
        unsigned T1OSI                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned NOT_MCLR               :1;
    };
    struct {
        unsigned CMP0                   :1;
        unsigned                        :4;
        unsigned nMCLR                  :1;
        unsigned AN3                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned T1CKI                  :1;
    };
    struct {
        unsigned ULPWUIN                :1;
        unsigned                        :4;
        unsigned LVDIN                  :1;
        unsigned                        :1;
        unsigned RJPU                   :1;
    };
} PORTAbits_t;
extern volatile PORTAbits_t PORTAbits __at(0xF80);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA4_POSN                                     0x4
#define _PORTA_RA4_POSITION                                 0x4
#define _PORTA_RA4_SIZE                                     0x1
#define _PORTA_RA4_LENGTH                                   0x1
#define _PORTA_RA4_MASK                                     0x10
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_RA6_POSN                                     0x6
#define _PORTA_RA6_POSITION                                 0x6
#define _PORTA_RA6_SIZE                                     0x1
#define _PORTA_RA6_LENGTH                                   0x1
#define _PORTA_RA6_MASK                                     0x40
#define _PORTA_RA7_POSN                                     0x7
#define _PORTA_RA7_POSITION                                 0x7
#define _PORTA_RA7_SIZE                                     0x1
#define _PORTA_RA7_LENGTH                                   0x1
#define _PORTA_RA7_MASK                                     0x80
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_TX_POSN                                      0x2
#define _PORTA_TX_POSITION                                  0x2
#define _PORTA_TX_SIZE                                      0x1
#define _PORTA_TX_LENGTH                                    0x1
#define _PORTA_TX_MASK                                      0x4
#define _PORTA_RX_POSN                                      0x3
#define _PORTA_RX_POSITION                                  0x3
#define _PORTA_RX_SIZE                                      0x1
#define _PORTA_RX_LENGTH                                    0x1
#define _PORTA_RX_MASK                                      0x8
#define _PORTA_AN2_POSN                                     0x4
#define _PORTA_AN2_POSITION                                 0x4
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x10
#define _PORTA_MCLR_POSN                                    0x5
#define _PORTA_MCLR_POSITION                                0x5
#define _PORTA_MCLR_SIZE                                    0x1
#define _PORTA_MCLR_LENGTH                                  0x1
#define _PORTA_MCLR_MASK                                    0x20
#define _PORTA_OSC2_POSN                                    0x6
#define _PORTA_OSC2_POSITION                                0x6
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x40
#define _PORTA_OSC1_POSN                                    0x7
#define _PORTA_OSC1_POSITION                                0x7
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x80
#define _PORTA_INT0_POSN                                    0x0
#define _PORTA_INT0_POSITION                                0x0
#define _PORTA_INT0_SIZE                                    0x1
#define _PORTA_INT0_LENGTH                                  0x1
#define _PORTA_INT0_MASK                                    0x1
#define _PORTA_INT1_POSN                                    0x1
#define _PORTA_INT1_POSITION                                0x1
#define _PORTA_INT1_SIZE                                    0x1
#define _PORTA_INT1_LENGTH                                  0x1
#define _PORTA_INT1_MASK                                    0x2
#define _PORTA_CK_POSN                                      0x2
#define _PORTA_CK_POSITION                                  0x2
#define _PORTA_CK_SIZE                                      0x1
#define _PORTA_CK_LENGTH                                    0x1
#define _PORTA_CK_MASK                                      0x4
#define _PORTA_DT_POSN                                      0x3
#define _PORTA_DT_POSITION                                  0x3
#define _PORTA_DT_SIZE                                      0x1
#define _PORTA_DT_LENGTH                                    0x1
#define _PORTA_DT_MASK                                      0x8
#define _PORTA_T0CKI_POSN                                   0x4
#define _PORTA_T0CKI_POSITION                               0x4
#define _PORTA_T0CKI_SIZE                                   0x1
#define _PORTA_T0CKI_LENGTH                                 0x1
#define _PORTA_T0CKI_MASK                                   0x10
#define _PORTA_CLKO_POSN                                    0x6
#define _PORTA_CLKO_POSITION                                0x6
#define _PORTA_CLKO_SIZE                                    0x1
#define _PORTA_CLKO_LENGTH                                  0x1
#define _PORTA_CLKO_MASK                                    0x40
#define _PORTA_CLKI_POSN                                    0x7
#define _PORTA_CLKI_POSITION                                0x7
#define _PORTA_CLKI_SIZE                                    0x1
#define _PORTA_CLKI_LENGTH                                  0x1
#define _PORTA_CLKI_MASK                                    0x80
#define _PORTA_KBI0_POSN                                    0x0
#define _PORTA_KBI0_POSITION                                0x0
#define _PORTA_KBI0_SIZE                                    0x1
#define _PORTA_KBI0_LENGTH                                  0x1
#define _PORTA_KBI0_MASK                                    0x1
#define _PORTA_KBI1_POSN                                    0x1
#define _PORTA_KBI1_POSITION                                0x1
#define _PORTA_KBI1_SIZE                                    0x1
#define _PORTA_KBI1_LENGTH                                  0x1
#define _PORTA_KBI1_MASK                                    0x2
#define _PORTA_VREFP_POSN                                   0x4
#define _PORTA_VREFP_POSITION                               0x4
#define _PORTA_VREFP_SIZE                                   0x1
#define _PORTA_VREFP_LENGTH                                 0x1
#define _PORTA_VREFP_MASK                                   0x10
#define _PORTA_T1OSO_POSN                                   0x6
#define _PORTA_T1OSO_POSITION                               0x6
#define _PORTA_T1OSO_SIZE                                   0x1
#define _PORTA_T1OSO_LENGTH                                 0x1
#define _PORTA_T1OSO_MASK                                   0x40
#define _PORTA_T1OSI_POSN                                   0x7
#define _PORTA_T1OSI_POSITION                               0x7
#define _PORTA_T1OSI_SIZE                                   0x1
#define _PORTA_T1OSI_LENGTH                                 0x1
#define _PORTA_T1OSI_MASK                                   0x80
#define _PORTA_NOT_MCLR_POSN                                0x5
#define _PORTA_NOT_MCLR_POSITION                            0x5
#define _PORTA_NOT_MCLR_SIZE                                0x1
#define _PORTA_NOT_MCLR_LENGTH                              0x1
#define _PORTA_NOT_MCLR_MASK                                0x20
#define _PORTA_CMP0_POSN                                    0x0
#define _PORTA_CMP0_POSITION                                0x0
#define _PORTA_CMP0_SIZE                                    0x1
#define _PORTA_CMP0_LENGTH                                  0x1
#define _PORTA_CMP0_MASK                                    0x1
#define _PORTA_nMCLR_POSN                                   0x5
#define _PORTA_nMCLR_POSITION                               0x5
#define _PORTA_nMCLR_SIZE                                   0x1
#define _PORTA_nMCLR_LENGTH                                 0x1
#define _PORTA_nMCLR_MASK                                   0x20
#define _PORTA_AN3_POSN                                     0x6
#define _PORTA_AN3_POSITION                                 0x6
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x40
#define _PORTA_T1CKI_POSN                                   0x6
#define _PORTA_T1CKI_POSITION                               0x6
#define _PORTA_T1CKI_SIZE                                   0x1
#define _PORTA_T1CKI_LENGTH                                 0x1
#define _PORTA_T1CKI_MASK                                   0x40
#define _PORTA_ULPWUIN_POSN                                 0x0
#define _PORTA_ULPWUIN_POSITION                             0x0
#define _PORTA_ULPWUIN_SIZE                                 0x1
#define _PORTA_ULPWUIN_LENGTH                               0x1
#define _PORTA_ULPWUIN_MASK                                 0x1
#define _PORTA_LVDIN_POSN                                   0x5
#define _PORTA_LVDIN_POSITION                               0x5
#define _PORTA_LVDIN_SIZE                                   0x1
#define _PORTA_LVDIN_LENGTH                                 0x1
#define _PORTA_LVDIN_MASK                                   0x20
#define _PORTA_RJPU_POSN                                    0x7
#define _PORTA_RJPU_POSITION                                0x7
#define _PORTA_RJPU_SIZE                                    0x1
#define _PORTA_RJPU_LENGTH                                  0x1
#define _PORTA_RJPU_MASK                                    0x80

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0xF81);
#ifndef _LIB_BUILD
asm("PORTB equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned PWM0                   :1;
        unsigned PWM1                   :1;
        unsigned INT2                   :1;
        unsigned INT3                   :1;
        unsigned PWM2                   :1;
        unsigned PWM3                   :1;
        unsigned PWM4                   :1;
        unsigned PWM5                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned KBI2                   :1;
        unsigned KBI3                   :1;
        unsigned                        :2;
        unsigned PGC                    :1;
        unsigned PGD                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned CMP2                   :1;
        unsigned CMP1                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned T1OSO                  :1;
        unsigned T1OSI                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned T1CKI                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP2_PA2               :1;
    };
} PORTBbits_t;
