MikroElektronika/core_packages/PIC/XC8/def/PIC18LF1230/mcu.h
extern volatile PWMCON1bits_t PWMCON1bits __at(0xF85);
// bitfield macros
#define _PWMCON1_OSYNC_POSN                                 0x0
#define _PWMCON1_OSYNC_POSITION                             0x0
#define _PWMCON1_OSYNC_SIZE                                 0x1
#define _PWMCON1_OSYNC_LENGTH                               0x1
#define _PWMCON1_OSYNC_MASK                                 0x1
#define _PWMCON1_UDIS_POSN                                  0x1
#define _PWMCON1_UDIS_POSITION                              0x1
#define _PWMCON1_UDIS_SIZE                                  0x1
#define _PWMCON1_UDIS_LENGTH                                0x1
#define _PWMCON1_UDIS_MASK                                  0x2
#define _PWMCON1_SEVTDIR_POSN                               0x3
#define _PWMCON1_SEVTDIR_POSITION                           0x3
#define _PWMCON1_SEVTDIR_SIZE                               0x1
#define _PWMCON1_SEVTDIR_LENGTH                             0x1
#define _PWMCON1_SEVTDIR_MASK                               0x8
#define _PWMCON1_SEVOPS_POSN                                0x4
#define _PWMCON1_SEVOPS_POSITION                            0x4
#define _PWMCON1_SEVOPS_SIZE                                0x4
#define _PWMCON1_SEVOPS_LENGTH                              0x4
#define _PWMCON1_SEVOPS_MASK                                0xF0
#define _PWMCON1_SEVOPS0_POSN                               0x4
#define _PWMCON1_SEVOPS0_POSITION                           0x4
#define _PWMCON1_SEVOPS0_SIZE                               0x1
#define _PWMCON1_SEVOPS0_LENGTH                             0x1
#define _PWMCON1_SEVOPS0_MASK                               0x10
#define _PWMCON1_SEVOPS1_POSN                               0x5
#define _PWMCON1_SEVOPS1_POSITION                           0x5
#define _PWMCON1_SEVOPS1_SIZE                               0x1
#define _PWMCON1_SEVOPS1_LENGTH                             0x1
#define _PWMCON1_SEVOPS1_MASK                               0x20
#define _PWMCON1_SEVOPS2_POSN                               0x6
#define _PWMCON1_SEVOPS2_POSITION                           0x6
#define _PWMCON1_SEVOPS2_SIZE                               0x1
#define _PWMCON1_SEVOPS2_LENGTH                             0x1
#define _PWMCON1_SEVOPS2_MASK                               0x40
#define _PWMCON1_SEVOPS3_POSN                               0x7
#define _PWMCON1_SEVOPS3_POSITION                           0x7
#define _PWMCON1_SEVOPS3_SIZE                               0x1
#define _PWMCON1_SEVOPS3_LENGTH                             0x1
#define _PWMCON1_SEVOPS3_MASK                               0x80

// Register: PWMCON0
#define PWMCON0 PWMCON0
extern volatile unsigned char           PWMCON0             __at(0xF86);
#ifndef _LIB_BUILD
asm("PWMCON0 equ 0F86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMOD                   :3;
        unsigned                        :1;
        unsigned PWMEN                  :3;
    };
    struct {
        unsigned PMOD0                  :1;
        unsigned PMOD1                  :1;
        unsigned PMOD2                  :1;
        unsigned                        :1;
        unsigned PWMEN0                 :1;
        unsigned PWMEN1                 :1;
        unsigned PWMEN2                 :1;
    };
} PWMCON0bits_t;
extern volatile PWMCON0bits_t PWMCON0bits __at(0xF86);
// bitfield macros
#define _PWMCON0_PMOD_POSN                                  0x0
#define _PWMCON0_PMOD_POSITION                              0x0
#define _PWMCON0_PMOD_SIZE                                  0x3
#define _PWMCON0_PMOD_LENGTH                                0x3
#define _PWMCON0_PMOD_MASK                                  0x7
#define _PWMCON0_PWMEN_POSN                                 0x4
#define _PWMCON0_PWMEN_POSITION                             0x4
#define _PWMCON0_PWMEN_SIZE                                 0x3
#define _PWMCON0_PWMEN_LENGTH                               0x3
#define _PWMCON0_PWMEN_MASK                                 0x70
#define _PWMCON0_PMOD0_POSN                                 0x0
#define _PWMCON0_PMOD0_POSITION                             0x0
#define _PWMCON0_PMOD0_SIZE                                 0x1
#define _PWMCON0_PMOD0_LENGTH                               0x1
#define _PWMCON0_PMOD0_MASK                                 0x1
#define _PWMCON0_PMOD1_POSN                                 0x1
#define _PWMCON0_PMOD1_POSITION                             0x1
#define _PWMCON0_PMOD1_SIZE                                 0x1
#define _PWMCON0_PMOD1_LENGTH                               0x1
#define _PWMCON0_PMOD1_MASK                                 0x2
#define _PWMCON0_PMOD2_POSN                                 0x2
#define _PWMCON0_PMOD2_POSITION                             0x2
#define _PWMCON0_PMOD2_SIZE                                 0x1
#define _PWMCON0_PMOD2_LENGTH                               0x1
#define _PWMCON0_PMOD2_MASK                                 0x4
#define _PWMCON0_PWMEN0_POSN                                0x4
#define _PWMCON0_PWMEN0_POSITION                            0x4
#define _PWMCON0_PWMEN0_SIZE                                0x1
#define _PWMCON0_PWMEN0_LENGTH                              0x1
#define _PWMCON0_PWMEN0_MASK                                0x10
#define _PWMCON0_PWMEN1_POSN                                0x5
#define _PWMCON0_PWMEN1_POSITION                            0x5
#define _PWMCON0_PWMEN1_SIZE                                0x1
#define _PWMCON0_PWMEN1_LENGTH                              0x1
#define _PWMCON0_PWMEN1_MASK                                0x20
#define _PWMCON0_PWMEN2_POSN                                0x6
#define _PWMCON0_PWMEN2_POSITION                            0x6
#define _PWMCON0_PWMEN2_SIZE                                0x1
#define _PWMCON0_PWMEN2_LENGTH                              0x1
#define _PWMCON0_PWMEN2_MASK                                0x40

// Register: SEVTCMPH
#define SEVTCMPH SEVTCMPH
extern volatile unsigned char           SEVTCMPH            __at(0xF87);
#ifndef _LIB_BUILD
asm("SEVTCMPH equ 0F87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEVTCMPH               :4;
    };
} SEVTCMPHbits_t;
