MikroElektronika/core_packages/PIC/XC8/def/PIC18LF1230/mcu.h
// Register: PDC2H
#define PDC2H PDC2H
extern volatile unsigned char           PDC2H               __at(0xF8C);
#ifndef _LIB_BUILD
asm("PDC2H equ 0F8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PDC2H                  :6;
    };
} PDC2Hbits_t;
extern volatile PDC2Hbits_t PDC2Hbits __at(0xF8C);
// bitfield macros
#define _PDC2H_PDC2H_POSN                                   0x0
#define _PDC2H_PDC2H_POSITION                               0x0
#define _PDC2H_PDC2H_SIZE                                   0x6
#define _PDC2H_PDC2H_LENGTH                                 0x6
#define _PDC2H_PDC2H_MASK                                   0x3F

// Register: PDC2L
#define PDC2L PDC2L
extern volatile unsigned char           PDC2L               __at(0xF8D);
#ifndef _LIB_BUILD
asm("PDC2L equ 0F8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PDC2L                  :8;
    };
} PDC2Lbits_t;
extern volatile PDC2Lbits_t PDC2Lbits __at(0xF8D);
// bitfield macros
#define _PDC2L_PDC2L_POSN                                   0x0
#define _PDC2L_PDC2L_POSITION                               0x0
#define _PDC2L_PDC2L_SIZE                                   0x8
#define _PDC2L_PDC2L_LENGTH                                 0x8
#define _PDC2L_PDC2L_MASK                                   0xFF

// Register: PDC1H
#define PDC1H PDC1H
extern volatile unsigned char           PDC1H               __at(0xF8E);
#ifndef _LIB_BUILD
asm("PDC1H equ 0F8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PDC1H                  :6;
    };
} PDC1Hbits_t;
extern volatile PDC1Hbits_t PDC1Hbits __at(0xF8E);
// bitfield macros
#define _PDC1H_PDC1H_POSN                                   0x0
#define _PDC1H_PDC1H_POSITION                               0x0
#define _PDC1H_PDC1H_SIZE                                   0x6
#define _PDC1H_PDC1H_LENGTH                                 0x6
#define _PDC1H_PDC1H_MASK                                   0x3F

// Register: PDC1L
#define PDC1L PDC1L
extern volatile unsigned char           PDC1L               __at(0xF8F);
#ifndef _LIB_BUILD
asm("PDC1L equ 0F8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PDC1L                  :8;
    };
} PDC1Lbits_t;
extern volatile PDC1Lbits_t PDC1Lbits __at(0xF8F);
// bitfield macros
#define _PDC1L_PDC1L_POSN                                   0x0
#define _PDC1L_PDC1L_POSITION                               0x0
#define _PDC1L_PDC1L_SIZE                                   0x8
#define _PDC1L_PDC1L_LENGTH                                 0x8
#define _PDC1L_PDC1L_MASK                                   0xFF

// Register: PDC0H
#define PDC0H PDC0H
extern volatile unsigned char           PDC0H               __at(0xF90);
#ifndef _LIB_BUILD
asm("PDC0H equ 0F90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PDC0H                  :6;
    };
} PDC0Hbits_t;
extern volatile PDC0Hbits_t PDC0Hbits __at(0xF90);
// bitfield macros
#define _PDC0H_PDC0H_POSN                                   0x0
#define _PDC0H_PDC0H_POSITION                               0x0
#define _PDC0H_PDC0H_SIZE                                   0x6
#define _PDC0H_PDC0H_LENGTH                                 0x6
#define _PDC0H_PDC0H_MASK                                   0x3F

// Register: PDC0L
#define PDC0L PDC0L
extern volatile unsigned char           PDC0L               __at(0xF91);
#ifndef _LIB_BUILD
asm("PDC0L equ 0F91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PDC0L                  :8;
    };
} PDC0Lbits_t;
extern volatile PDC0Lbits_t PDC0Lbits __at(0xF91);
// bitfield macros
#define _PDC0L_PDC0L_POSN                                   0x0
#define _PDC0L_PDC0L_POSITION                               0x0
#define _PDC0L_PDC0L_SIZE                                   0x8
#define _PDC0L_PDC0L_LENGTH                                 0x8
#define _PDC0L_PDC0L_MASK                                   0xFF

// Register: TRISA
#define TRISA TRISA
extern volatile unsigned char           TRISA               __at(0xF92);
#ifndef _LIB_BUILD
asm("TRISA equ 0F92h");
#endif
// aliases
extern volatile unsigned char           DDRA                __at(0xF92);
#ifndef _LIB_BUILD
asm("DDRA equ 0F92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISA0                 :1;
        unsigned TRISA1                 :1;
        unsigned TRISA2                 :1;
        unsigned TRISA3                 :1;
        unsigned TRISA4                 :1;
        unsigned TRISA5                 :1;
        unsigned TRISA6                 :1;
        unsigned TRISA7                 :1;
    };
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
        unsigned RA6                    :1;
        unsigned RA7                    :1;
    };
} TRISAbits_t;
extern volatile TRISAbits_t TRISAbits __at(0xF92);
// bitfield macros
#define _TRISA_TRISA0_POSN                                  0x0
#define _TRISA_TRISA0_POSITION                              0x0
#define _TRISA_TRISA0_SIZE                                  0x1
#define _TRISA_TRISA0_LENGTH                                0x1
#define _TRISA_TRISA0_MASK                                  0x1
#define _TRISA_TRISA1_POSN                                  0x1
#define _TRISA_TRISA1_POSITION                              0x1
#define _TRISA_TRISA1_SIZE                                  0x1
#define _TRISA_TRISA1_LENGTH                                0x1
#define _TRISA_TRISA1_MASK                                  0x2
#define _TRISA_TRISA2_POSN                                  0x2
#define _TRISA_TRISA2_POSITION                              0x2
#define _TRISA_TRISA2_SIZE                                  0x1
#define _TRISA_TRISA2_LENGTH                                0x1
#define _TRISA_TRISA2_MASK                                  0x4
#define _TRISA_TRISA3_POSN                                  0x3
#define _TRISA_TRISA3_POSITION                              0x3
#define _TRISA_TRISA3_SIZE                                  0x1
#define _TRISA_TRISA3_LENGTH                                0x1
#define _TRISA_TRISA3_MASK                                  0x8
#define _TRISA_TRISA4_POSN                                  0x4
#define _TRISA_TRISA4_POSITION                              0x4
#define _TRISA_TRISA4_SIZE                                  0x1
#define _TRISA_TRISA4_LENGTH                                0x1
#define _TRISA_TRISA4_MASK                                  0x10
#define _TRISA_TRISA5_POSN                                  0x5
#define _TRISA_TRISA5_POSITION                              0x5
#define _TRISA_TRISA5_SIZE                                  0x1
#define _TRISA_TRISA5_LENGTH                                0x1
#define _TRISA_TRISA5_MASK                                  0x20
#define _TRISA_TRISA6_POSN                                  0x6
#define _TRISA_TRISA6_POSITION                              0x6
#define _TRISA_TRISA6_SIZE                                  0x1
#define _TRISA_TRISA6_LENGTH                                0x1
#define _TRISA_TRISA6_MASK                                  0x40
#define _TRISA_TRISA7_POSN                                  0x7
#define _TRISA_TRISA7_POSITION                              0x7
#define _TRISA_TRISA7_SIZE                                  0x1
#define _TRISA_TRISA7_LENGTH                                0x1
#define _TRISA_TRISA7_MASK                                  0x80
#define _TRISA_RA0_POSN                                     0x0
#define _TRISA_RA0_POSITION                                 0x0
#define _TRISA_RA0_SIZE                                     0x1
#define _TRISA_RA0_LENGTH                                   0x1
#define _TRISA_RA0_MASK                                     0x1
#define _TRISA_RA1_POSN                                     0x1
#define _TRISA_RA1_POSITION                                 0x1
#define _TRISA_RA1_SIZE                                     0x1
#define _TRISA_RA1_LENGTH                                   0x1
#define _TRISA_RA1_MASK                                     0x2
#define _TRISA_RA2_POSN                                     0x2
#define _TRISA_RA2_POSITION                                 0x2
#define _TRISA_RA2_SIZE                                     0x1
#define _TRISA_RA2_LENGTH                                   0x1
#define _TRISA_RA2_MASK                                     0x4
#define _TRISA_RA3_POSN                                     0x3
#define _TRISA_RA3_POSITION                                 0x3
#define _TRISA_RA3_SIZE                                     0x1
#define _TRISA_RA3_LENGTH                                   0x1
#define _TRISA_RA3_MASK                                     0x8
#define _TRISA_RA4_POSN                                     0x4
#define _TRISA_RA4_POSITION                                 0x4
#define _TRISA_RA4_SIZE                                     0x1
#define _TRISA_RA4_LENGTH                                   0x1
#define _TRISA_RA4_MASK                                     0x10
#define _TRISA_RA5_POSN                                     0x5
#define _TRISA_RA5_POSITION                                 0x5
#define _TRISA_RA5_SIZE                                     0x1
#define _TRISA_RA5_LENGTH                                   0x1
#define _TRISA_RA5_MASK                                     0x20
#define _TRISA_RA6_POSN                                     0x6
#define _TRISA_RA6_POSITION                                 0x6
#define _TRISA_RA6_SIZE                                     0x1
#define _TRISA_RA6_LENGTH                                   0x1
#define _TRISA_RA6_MASK                                     0x40
#define _TRISA_RA7_POSN                                     0x7
#define _TRISA_RA7_POSITION                                 0x7
#define _TRISA_RA7_SIZE                                     0x1
#define _TRISA_RA7_LENGTH                                   0x1
#define _TRISA_RA7_MASK                                     0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TRISA0                 :1;
        unsigned TRISA1                 :1;
        unsigned TRISA2                 :1;
        unsigned TRISA3                 :1;
        unsigned TRISA4                 :1;
        unsigned TRISA5                 :1;
        unsigned TRISA6                 :1;
        unsigned TRISA7                 :1;
    };
    struct {
        unsigned RA0                    :1;
        unsigned RA1                    :1;
        unsigned RA2                    :1;
        unsigned RA3                    :1;
        unsigned RA4                    :1;
        unsigned RA5                    :1;
        unsigned RA6                    :1;
        unsigned RA7                    :1;
    };
} DDRAbits_t;
